; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p10---int100n150-m25---int100c200---s406---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level23 level23)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level23 level24)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level23 level25)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level23 level26)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level23 level27)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level23 level28)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level23 level29)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level23 level30)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level23 level31)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level23 level32)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level23 level33)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level23 level34)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level23 level35)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level23 level36)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level23 level37)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level23 level38)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level23 level39)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level23 level40)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level23 level41)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level23 level42)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level23 level43)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level23 level44)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level23 level45)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level23 level46)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level23 level47)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level23 level48)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level23 level49)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level23 level50)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level23 level51)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level23 level52)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level23 level53)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level23 level54)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level23 level55)
(sum level33 level3 level36)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level23 level56)
(sum level34 level3 level37)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level23 level57)
(sum level35 level3 level38)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level23 level58)
(sum level36 level3 level39)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level23 level59)
(sum level37 level3 level40)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level23 level60)
(sum level38 level3 level41)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level23 level61)
(sum level39 level3 level42)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level23 level62)
(sum level40 level3 level43)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level23 level63)
(sum level41 level3 level44)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level23 level64)
(sum level42 level3 level45)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level23 level65)
(sum level43 level3 level46)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level23 level66)
(sum level44 level3 level47)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level23 level67)
(sum level45 level3 level48)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level23 level68)
(sum level46 level3 level49)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level47 level3 level50)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level48 level3 level51)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level49 level3 level52)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level50 level3 level53)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level51 level3 level54)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level52 level3 level55)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level53 level3 level56)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level15 level68)
(sum level54 level3 level57)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level55 level3 level58)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level56 level3 level59)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level57 level3 level60)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level58 level3 level61)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level59 level3 level62)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level60 level3 level63)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level61 level3 level64)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level62 level3 level65)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level63 level3 level66)
(sum level63 level5 level68)
(sum level64 level3 level67)
(sum level65 level3 level68)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l0 l3)
(fuelcost level5 l0 l3)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l3)
(fuelcost level15 l1 l3)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l3)
(fuelcost level3 l2 l3)
(connected l3 l0)
(fuelcost level5 l3 l0)
(connected l3 l1)
(fuelcost level15 l3 l1)
(connected l3 l2)
(fuelcost level3 l3 l2)

(at t0 l2)
(fuel t0 level68)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l0)
(at p3 l3)
(at p4 l3)
(at p5 l2)
(at p6 l2)
(at p7 l1)
(at p8 l1)
(at p9 l1)
)

(:goal
(and
(at p0 l3)
(at p1 l3)
(at p2 l2)
(at p3 l0)
(at p4 l1)
(at p5 l1)
(at p6 l3)
(at p7 l0)
(at p8 l3)
(at p9 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 10
2. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 10
3. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 10
4. (drive t0 l2 l3 level65 level3 level68)
   deleted: (at t0 l2) (fuel t0 level68)
   added: (at t0 l3) (fuel t0 level65)
   goals met: 0 of 10
5. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 1 of 10
6. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 1 of 10
7. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 1 of 10
8. (drive t0 l3 l1 level50 level15 level65)
   deleted: (at t0 l3) (fuel t0 level65)
   added: (at t0 l1) (fuel t0 level50)
   goals met: 1 of 10
9. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 2 of 10
10. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 3 of 10
11. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 3 of 10
12. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 3 of 10
13. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 3 of 10
14. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 3 of 10
15. (drive t0 l1 l0 level34 level16 level50)
   deleted: (at t0 l1) (fuel t0 level50)
   added: (at t0 l0) (fuel t0 level34)
   goals met: 3 of 10
16. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 3 of 10
17. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 4 of 10
18. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 5 of 10
19. (drive t0 l0 l2 level11 level23 level34)
   deleted: (at t0 l0) (fuel t0 level34)
   added: (at t0 l2) (fuel t0 level11)
   goals met: 5 of 10
20. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 6 of 10
21. (drive t0 l2 l3 level8 level3 level11)
   deleted: (at t0 l2) (fuel t0 level11)
   added: (at t0 l3) (fuel t0 level8)
   goals met: 6 of 10
22. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 7 of 10
23. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 8 of 10
24. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 9 of 10
25. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 10 of 10
